#### Terraform Plan for Dev Environment 📋

```
Acquiring state lock. This may take a few moments...
module.post_xyz_lambda.data.archive_file.lambda_zip: Reading...
module.get_xyz_lambda.data.archive_file.lambda_zip: Reading...
module.utility_layer.data.archive_file.layer_zip: Reading...
module.dependencies_layer.data.archive_file.layer_zip: Reading...
module.utility_layer.data.archive_file.layer_zip: Read complete after 0s [id=0a188f87be146132927346567b1f7934c25c3dc2]
module.dependencies_layer.data.archive_file.layer_zip: Read complete after 0s [id=cc8211afb4c9e00de7c8bf34364fb577fb3867d7]
module.get_xyz_lambda.data.archive_file.lambda_zip: Read complete after 0s [id=7e1ab8e015653f3e3a8af0f2a2641ea1905f6dde]
module.post_xyz_lambda.data.archive_file.lambda_zip: Read complete after 0s [id=155fd2585cbc28f2a502b448e449ee2fb407d0ef]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_gateway.aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_integration.get_xyz will be created
  + resource "aws_api_gateway_integration" "get_xyz" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_integration.post_xyz will be created
  + resource "aws_api_gateway_integration" "post_xyz" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_method.get_xyz will be created
  + resource "aws_api_gateway_method" "get_xyz" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_method.post_xyz will be created
  + resource "aws_api_gateway_method" "post_xyz" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.xyz will be created
  + resource "aws_api_gateway_resource" "xyz" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "xyz"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_rest_api.this will be created
  + resource "aws_api_gateway_rest_api" "this" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "efy-web-backend-dev-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + tags_all                     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
    }

  # module.api_gateway.aws_api_gateway_stage.this will be created
  + resource "aws_api_gateway_stage" "this" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "default"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.api_gateway.aws_lambda_permission.get_xyz will be created
  + resource "aws_lambda_permission" "get_xyz" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway.aws_lambda_permission.post_xyz will be created
  + resource "aws_lambda_permission" "post_xyz" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.dependencies_layer.aws_lambda_layer_version.this will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "nodejs18.x",
          + "nodejs20.x",
        ]
      + created_date                = (known after apply)
      + description                 = "Shared dependencies for Lambda functions - dev"
      + filename                    = "./builds/efy-web-backend-dev-dependencies-layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "efy-web-backend-dev-dependencies-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "2OrgUTqKaxDfvFqaTvTQiFrZYTHJW9OXTB/ZfqjDxi8="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.get_xyz_lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "efy-web-backend-dev-get-xyz-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + unique_id             = (known after apply)
    }

  # module.get_xyz_lambda.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "efy-web-backend-dev-get-xyz-role"
    }

  # module.get_xyz_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./builds/efy-web-backend-dev-get-xyz.zip"
      + function_name                  = "efy-web-backend-dev-get-xyz"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "9EnRLxPn9tip8r/xLLyW4+uXZ0XvwWiVaBA5hZ9fnXI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + tags_all                       = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # module.post_xyz_lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "efy-web-backend-dev-post-xyz-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + unique_id             = (known after apply)
    }

  # module.post_xyz_lambda.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "efy-web-backend-dev-post-xyz-role"
    }

  # module.post_xyz_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./builds/efy-web-backend-dev-post-xyz.zip"
      + function_name                  = "efy-web-backend-dev-post-xyz"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "A7l/147xO7oiZKHr8fgN8Xe/iS7J3aCNuYQSH8Z4Wlw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + tags_all                       = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "efy-web-backend-dev"
          + "Project"     = "efy-web-backend"
          + "Workspace"   = "dev"
        }
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # module.utility_layer.aws_lambda_layer_version.this will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "nodejs18.x",
          + "nodejs20.x",
        ]
      + created_date                = (known after apply)
      + description                 = "Shared utility functions for Lambda functions - dev"
      + filename                    = "./builds/efy-web-backend-dev-utility-layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "efy-web-backend-dev-utility-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "p/YN46ir/W6ZlaXQQKbKshBfpBbPEaUhK1CaYYzhgdk="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_id         = (known after apply)
  + api_gateway_url        = (known after apply)
  + common_tags            = {
      + CostCenter  = "development"
      + Environment = "dev"
      + ManagedBy   = "terraform"
      + Name        = "efy-web-backend-dev"
      + Project     = "efy-web-backend"
      + Workspace   = "dev"
    }
  + dependencies_layer_arn = (known after apply)
  + environment            = "dev"
  + get_xyz_lambda_arn     = (known after apply)
  + post_xyz_lambda_arn    = (known after apply)
  + utility_layer_arn      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

*This plan was generated automatically for the dev environment.*